[
"Signs of successful brain surgeries go as far back as the Stone Age.",
"An adult brain weighs about 3 pounds.",
"About 75 percent of the brain is made up of water. This means that dehydration, even in small amounts, can have a negative effect on the brain functions.",
"The largest brain of any animal is that of the sperm whale. It weighs about 20 pounds.",
"The human brain will grow three times its size in the first year of life. It continues to grow until you’re about 18 years old.",
"Headaches are caused by a chemical reaction in your brain combined with the muscles and nerves of your neck and head.",
"The brain of a human contains approximately one hundred billion neurons",
"It is a myth that humans only use 10 percent of our brain. We actually use all of it. We’re even using more than 10 percent when we sleep.",
"Cholesterol is key to learning and memory. However, high cholesterol has different effects depending on your age and other factors.",
"Information runs between neurons in your brain for everything we see, think, or do. These neurons move information at different speeds. The fastest speed for information to pass between neurons is about 250 mph.",
"Dreams are believed to be a combination of imagination, phycological factors, and neurological factors. They prove that your brain is working even when you are sleeping.",
"Phantom limb pain syndrome is when the central nervous system, which includes your brain, continues to feel the pain of a limb that has been amputated.",
"The brain can’t feel pain. It interprets pain signals sent to it, but it does not feel pain.",
"A brain freeze is really a sphenopalatine ganglioneuralgia. It happens when something you eat or drink something that’s cold. It chills the blood vessels and arteries in the very back of the throat, including the ones that take blood to your brain. These constrict when they’re cold and open back up with they’re warm again, causing the pain in your forehead.",
"The human brain begins to lose some memory abilities as well as some cognitive skills by your late 20s.",
"The human brain gets smaller as we get older. This usually happens sometime after middle age.",
"During the mummification process, Egyptians would usually remove the brains through the nose.",
"Alcohol effects your brain in ways that include blurred vision, slurred speaking, an unsteady walk, and more. These usually disappear once you become sober again. However, if you drink often for long periods of time, there is evidence that alcohol can affect your brain permanently and not reverse once you become sober again. Long term effects include memory issues and some reduced cognitive function.",
"Eyewitness accounts of criminal suspects is usually only about 50 percent accurate because it is difficult for your brain to remember the details of someone you’re not familiar with. Traumatic events can also affect the brains ability to remember details.",
"Computer or video games may help improve cognitive abilities. However, more studies must be conducted to learn how much they help or what types of games help.",
"Your brain uses 20 percent of the oxygen and blood in your body."
]